#+begin_src python :dir src :results drawer :exports results
import endoexport.export as E; return E.make_parser().prog
#+end_src

#+RESULTS:
:results:
Tool to export your personal Endomondo data
:end:

* Setting up
1. The easiest way is =pip3 install --user git+https://github.com/karlicoss/endoexport=.

   Alternatively, use =git clone --recursive=, or =git pull && git submodules update --init=. After that, you can use =pip3 install --editable=.
2. Run =./export.py --login= to get your token (you only need to do it once)

* Exporting

#+begin_src python :dir src :results drawer :exports results
import endoexport.export as E; return E.make_parser().epilog
#+end_src

#+RESULTS:
:results:

Usage:

*Recommended*: create =secrets.py= keeping your api parameters, e.g.:


: email = "EMAIL"
: token = "TOKEN"


After that, use:

: python3 -m endoexport.export --secrets /path/to/secrets.py

That way you type less and have control over where you keep your plaintext secrets.

*Alternatively*, you can pass parameters directly, e.g.

: python3 -m endoexport.export --email <email> --token <token>

However, this is verbose and prone to leaking your keys/tokens/passwords in shell history.



I *highly* recommend checking exported files at least once just to make sure they contain everything you expect from your export. If not, please feel free to ask or raise an issue!

:end:

# TODO include dal section

